"""
Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого).
"""

a = int(input('Введите первое число: '))
b = int(input('Введите второе число, отличное от первого: '))
c = int(input('Введите третье число, отличное от первого и второго: '))

if a > b:
    if a > c:
        if b > c:
            print(f'Среднее число: {b}')
        else:
            print(f'Среднее число: {c}')
    else:
        print(f'Среднее число: {a}')
elif a > c:
    print(f'Среднее число: {a}')
elif b > c:
    print(f'Среднее число: {c}')
else:
    print(f'Среднее число: {b}')